14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
            if (streamActive) return;

            showStreamStatus('正在连接...');

            // 创建新的Image对象用于加载MJPEG流
            const img = new Image();
            img.onload = function() {
                // 第一帧加载成功，隐藏状态消息
                showStreamStatus(null);
                streamActive = true;
            };

            img.onerror = function() {
                showStreamStatus('流媒体加载失败', true);
                showNotification('流媒体加载失败', 5000);
                stopStream();
            };

            // 使用时间戳防止缓存
            img.src = '/stream?t=' + new Date().getTime();
            mjpegStream = img;

            // 设置定时器来更新Canvas
            streamInterval = setInterval(updateCanvas, 30); // 约33fps的更新率

            // 计算FPS
            setInterval(calculateStreamFps, 1000);
        }

        // 停止流媒体
        function stopStream() {
            if (!streamActive) return;

            clearInterval(streamInterval);
            streamActive = false;
            mjpegStream = null;

            // 重置Canvas
            ctx.fillStyle = '#f0f0f0';
            ctx.fillRect(0, 0, streamCanvas.width, streamCanvas.height);
            ctx.fillStyle = '#666';
            ctx.font = '20px Arial';
            ctx.textAlign = 'center';
            ctx.textBaseline = 'middle';
            ctx.fillText('点击开始流媒体', streamCanvas.width / 2, streamCanvas.height / 2);

            showNotification('流媒体已停止');
        }

        // 更新Canvas
        function updateCanvas() {
            if (!streamActive || !mjpegStream) return;

            try {
                ctx.drawImage(mjpegStream, 0, 0, streamCanvas.width, streamCanvas.height);
                frameCount++;
                lastFrameTime = performance.now();
            } catch (e) {
                console.error('Canvas更新错误:', e);
            }
        }

        // 计算流媒体FPS
        function calculateStreamFps() {
            if (!streamActive) {
                streamFps = 0;
                return;
            }

            streamFps = frameCount;
            frameCount = 0;
            fpsDisplay.textContent = `${streamFps} FPS`;
        }

        // 点击Canvas开始/停止流媒体
        streamCanvas.addEventListener('click', function() {
            if (streamActive) {
                stopStream();
            } else {
                startStream();
            }
        });

        // 显示通知
        function showNotification(message, duration = 3000) {
            notificationEl.textContent = message;
            notificationEl.classList.add('show');

            setTimeout(() => {
                notificationEl.classList.remove('show');
            }, duration);
        }

        // 格式化时间为 HH:MM:SS
        function formatTime(seconds) {
            const hrs = Math.floor(seconds / 3600);
            const mins = Math.floor((seconds % 3600) / 60);
            const secs = Math.floor(seconds % 60);
            return `${hrs.toString().padStart(2, '0')}:${mins.toString().padStart(2, '0')}:${secs.toString().padStart(2, '0')}`;
        }

        // 获取录制统计信息
        async function fetchRecordingStats() {
            try {
                const response = await fetch('/recording_stats');
                const data = await response.json();

                if (data.recording) {
                    // 显示录制信息区域
                    recordingInfoEl.style.display = 'block';

                    // 更新各项统计信息
                    recFilenameEl.textContent = data.filename || '-';
                    recDurationEl.textContent = formatTime(data.duration);
                    recSizeEl.textContent = data.size;
                    recFramesEl.textContent = data.frames;
                    recFpsEl.textContent = `${data.fps.toFixed(1)} FPS`;
                } else {
                    // 隐藏录制信息区域
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error fetching recording stats:', error);
            }
        }

        // 更新录制状态
        async function updateStatus() {
            try {
                const response = await fetch('/record');
                const statusText = await response.text();

                if (statusText.includes('Recording')) {
                    statusEl.textContent = '正在录制';
                    statusEl.className = 'status status-recording';
                    startBtn.disabled = true;
                    stopBtn.disabled = false;

                    // 如果流媒体正在播放，停止它
                    if (streamActive) {
                        stopStream();
                        showStreamStatus('录制进行中，无法播放流媒体', true);
                    }

                    // 获取录制统计信息
                    await fetchRecordingStats();
                } else {
                    statusEl.textContent = '准备就绪';
                    statusEl.className = 'status status-stopped';
                    startBtn.disabled = false;
                    stopBtn.disabled = true;
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error checking status:', error);
            }
        }

        // 开始录制
        async function startRecording() {
            try {
                // 如果流媒体正在播放，停止它
                if (streamActive) {
                    stopStream();
                    showStreamStatus('录制进行中，无法播放流媒体', true);
                }

                const response = await fetch('/record?action=start');
                const result = await response.text();

                if (result.includes('started')) {
                    showNotification('录制已开始');
                } else if (result.includes('streaming')) {
                    showNotification('无法在流媒体播放时录制', 5000);
                } else {
                    showNotification(result);
                }

                updateStatus();
            } catch (error) {
                showNotification('开始录制失败');
                console.error('Error starting recording:', error);
            }
        }

        // 停止录制
        async function stopRecording() {
            try {
                const response = await fetch('/record?action=stop');
                const result = await response.text();
                showNotification(result.includes('stopped') ? '录制已停止' : result);
                updateStatus();
            } catch (error) {
                showNotification('停止录制失败');
                console.error('Error stopping recording:', error);
            }
        }

        // 设置FPS
        async function setFPS(fps) {
            fpsValue.textContent = fps;
            fpsDisplay.textContent = `${fps} FPS`;

