14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        if (httpd_query_key_value(query, "enable", value, sizeof(value)) == ESP_OK) {
            if (strcmp(value, "1") == 0) {
                enableMPU = true;
                changed = true;
            } else if (strcmp(value, "0") == 0) {
                enableMPU = false;
                changed = true;
            }
        }
    }
    httpd_resp_set_type(req, "text/plain");
    if (changed) {
        httpd_resp_sendstr(req, enableMPU ? "MPU enabled" : "MPU disabled");
    } else {
        httpd_resp_sendstr(req, enableMPU ? "MPU is ON" : "MPU is OFF");
    }
    return ESP_OK;
}

void recordTask(void *param) {
    size_t psram_size = ESP.getFreePsram();
    // 直接使用最多6MB作为缓冲区（如果PSRAM足够）
    size_t buffer_size = psram_size > 6291456 ? 6291456 : (psram_size > 2097152 ? 2097152 : (psram_size > 131072 ? 131072 : (psram_size > 32768 ? 32768 : 4096)));
    uint8_t* temp_buffer = NULL;

    if(psram_size > buffer_size) {
        temp_buffer = (uint8_t*)ps_malloc(buffer_size);
        Serial.printf("[I] Using PSRAM for video buffer, size: %d bytes\n", buffer_size);
    } else if(psram_size > 0) {
        temp_buffer = (uint8_t*)ps_malloc(buffer_size);
        Serial.printf("[I] Using PSRAM for video buffer, size: %d bytes\n", buffer_size);
    } else {
        temp_buffer = (uint8_t*)malloc(buffer_size);
        Serial.printf("[I] Using heap for video buffer, size: %d bytes\n", buffer_size);
    }

    if(!temp_buffer) {
        Serial.printf("[E] Failed to allocate video buffer\n");
        isRecording = false;
        vTaskDelete(NULL);
        return;
    }

    size_t buffer_used = 0;
    int totalFrameCount = 0; // 总帧数

    unsigned long lastFpsMillis = millis();
    int lastFpsFrameCount = 0;
    unsigned long lastFrameTime = 0; // Track time of last frame capture

    while (isRecording) {
        // FPS control - calculate time since last frame
        unsigned long currentTime = millis();
        unsigned long elapsedTime = currentTime - lastFrameTime;

        // If we need to wait to maintain the target FPS
        if (elapsedTime < minFrameTimeMs) {
            // Wait the remaining time to achieve target FPS
            delay(minFrameTimeMs - elapsedTime);
            currentTime = millis(); // Update current time after delay
        }

        // Record the time before capturing the frame
        lastFrameTime = currentTime;

        camera_fb_t *fb = esp_camera_fb_get();
        if (fb) {
            // Read MPU data only if enabled, otherwise fill with zeros
            MPUData mpu_data = {};
            if (enableMPU) {
                readMPUData();
                mpu_data = getMPUData();
            }

            uint64_t timestamp = esp_timer_get_time();
            // Store frame size, timestamp, and MPU data
            size_t data_size = sizeof(timestamp) + sizeof(uint32_t) + fb->len + (enableMPU ? sizeof(MPUData) : 0);

            // If adding this frame would exceed buffer, flush first
            if (buffer_used + data_size > buffer_size) {
                if (buffer_used > 0) {
                    videoFile.write(temp_buffer, buffer_used);
                    buffer_used = 0;
                }
            }

            // If frame is too large for buffer, write directly
            if (data_size > buffer_size) {
                videoFile.write((uint8_t *)&timestamp, sizeof(timestamp));
                uint32_t len = fb->len;
                videoFile.write((uint8_t *)&len, 4);
                // Write MPU data only if enabled
                if (enableMPU) {
                    videoFile.write((uint8_t *)&mpu_data, sizeof(MPUData));
                }
                videoFile.write(fb->buf, fb->len);
            } else {
                // Otherwise add to buffer
                memcpy(temp_buffer + buffer_used, (uint8_t *)&timestamp, sizeof(timestamp));
                buffer_used += sizeof(timestamp);
                uint32_t len = fb->len;
                memcpy(temp_buffer + buffer_used, (uint8_t *)&len, 4);
                buffer_used += 4;
                // Add MPU data to buffer only if enabled
                if (enableMPU) {
                    memcpy(temp_buffer + buffer_used, (uint8_t *)&mpu_data, sizeof(MPUData));
                    buffer_used += sizeof(MPUData);
                }
                memcpy(temp_buffer + buffer_used, fb->buf, fb->len);
                buffer_used += fb->len;
            }

            totalFrameCount++;
            currentFrameCount = totalFrameCount; // Update global frame count
            lastFpsFrameCount++;
            esp_camera_fb_return(fb);

            // 输出每秒帧率
            unsigned long nowFpsMillis = millis();
            if (nowFpsMillis - lastFpsMillis >= 1000) {
                currentFps = lastFpsFrameCount; // Update global FPS counter
                Serial.printf("[I] FPS: %d\n", lastFpsFrameCount);
                lastFpsFrameCount = 0;
                lastFpsMillis = nowFpsMillis;
            }

            // Flush every ~2 seconds to减少写入频率
            static uint32_t last_flush = 0;
            uint32_t now = millis();
            if (now - last_flush > 2000) {
                if (buffer_used > 0) {
                    videoFile.write(temp_buffer, buffer_used);
                    buffer_used = 0;
                }
                videoFile.flush();
                // Update current recording size
                currentRecordingSize = videoFile.size();
                last_flush = now;
            }
        }
    }

    // Final flush of any remaining data
    if (buffer_used > 0) {
        videoFile.write(temp_buffer, buffer_used);
    }
    videoFile.flush();
    Serial.printf("[I] Total frames saved: %d\n", totalFrameCount);

    // Free the buffer
    free(temp_buffer);
    vTaskDelete(NULL);
}

// Handler for starting/stopping recording
static esp_err_t record_handler(httpd_req_t *req)
{
    Serial.printf("[I] Record handler called\n");

