14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    char *buf = NULL;
    char action[32] = {0}; // Initialize to zeros

    // Parse query parameters
    size_t buf_len = httpd_req_get_url_query_len(req);
    Serial.printf("[I] Query length: %d\n", buf_len);

    if (buf_len > 0)
    {
        buf = (char *)malloc(buf_len + 1);
        if (buf == NULL) {
            Serial.printf("[E] Failed to allocate memory for query\n");
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }

        esp_err_t parse_result = httpd_req_get_url_query_str(req, buf, buf_len + 1);
        Serial.printf("[I] Parse query result: %d, query: %s\n", parse_result, buf);

        if (parse_result == ESP_OK)
        {
            esp_err_t key_result = httpd_query_key_value(buf, "action", action, sizeof(action));
            Serial.printf("[I] Parse key result: %d, action: %s\n", key_result, action);

            if (key_result == ESP_OK)
            {
                if (strcmp(action, "start") == 0)
                {
                    Serial.printf("[I] Starting recording\n");
                    // Check if already recording
                    if (isRecording) {
                        Serial.printf("[I] Already recording\n");
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Already recording");
                        free(buf);
                        return ESP_OK;
                    }

                    // Check if streaming is active
                    if (isStreaming)
                    {
                        Serial.printf("[I] Cannot record while streaming is active\n");
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Cannot record while streaming is active");
                        free(buf);
                        return ESP_OK;
                    }

                    // Generate a unique file path
                    String uniqueFilePath = generateUniqueFilePath(videoFilePath);
                    currentRecordingPath = uniqueFilePath; // Store current recording path

                    // Start recording
                    videoFile = SD_MMC.open(uniqueFilePath.c_str(), FILE_WRITE);
                    if (videoFile)
                    {
                        isRecording = true;
                        recordingStartTime = millis();
                        currentFrameCount = 0;
                        currentRecordingSize = 0;
                        currentFps = 0.0;
                        Serial.printf("[I] Started recording to %s\n", uniqueFilePath.c_str());
                        Serial.printf("Started recording to %s\r\n", uniqueFilePath.c_str()); // Added for serial output
                        xTaskCreatePinnedToCore(recordTask, "recordTask", 4096, NULL, 1, &recordTaskHandle, 1);
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Recording started");
                    }
                    else
                    {
                        Serial.printf("[E] Failed to open file for writing\n");
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Failed to open file for recording");
                    }
                }
                else if (strcmp(action, "stop") == 0)
                {
                    Serial.printf("[I] Stopping recording\n");
                    // Stop recording
                    if (isRecording) {
                        isRecording = false;
                        if (recordTaskHandle) {
                            recordTaskHandle = NULL;
                        }
                        videoFile.close();
                        // Verify video was recorded by checking the file size
                        File checkFile = SD_MMC.open(videoFilePath, FILE_READ);
                        if (checkFile) {
                            Serial.printf("[I] Recorded video size: %d bytes\n", checkFile.size());
                            checkFile.close();
                        } else {
                            Serial.printf("[E] Unable to open video file for verification\n");
                        }
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Recording stopped");
                    } else {
                        Serial.printf("[I] Not recording\n");
                        httpd_resp_set_type(req, "text/plain");
                        httpd_resp_sendstr(req, "Not recording");
                    }
                }
                else
                {
                    Serial.printf("[I] Unknown action: %s\n", action);
                    httpd_resp_set_type(req, "text/plain");
                    httpd_resp_sendstr(req, "Unknown action");
                }
            }
            else
            {
                Serial.printf("[I] Action parameter not found\n");
                httpd_resp_set_type(req, "text/plain");
                httpd_resp_sendstr(req, "Action parameter missing");
            }
        }
        else
        {
            Serial.printf("[E] Failed to parse URL query\n");
            httpd_resp_set_type(req, "text/plain");
            httpd_resp_sendstr(req, "Failed to parse URL query");
        }
        free(buf);
    }
    else
    {
        // No parameters - return status
        httpd_resp_set_type(req, "text/plain");
        if (isRecording) {
            httpd_resp_sendstr(req, "Status: Recording");
        } else {
            httpd_resp_sendstr(req, "Status: Not recording");
        }
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return ESP_OK;
}

// Add a simple index handler to show recording controls
static esp_err_t index_handler(httpd_req_t *req) {
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, RECORDING_CONTROL_HTML, strlen(RECORDING_CONTROL_HTML));
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static esp_err_t xclk_handler(httpd_req_t *req)
{
    // Set a fixed default XCLK value instead of parsing from request
    int xclk = 20; // Set a fixed value of 20 MHz for the XCLK
    Serial.printf("[I] Setting fixed XCLK: %d MHz\n", xclk);

    sensor_t *s = esp_camera_sensor_get();
    int res = s->set_xclk(s, LEDC_TIMER_0, xclk);
    if (res)
    {
        return httpd_resp_send_500(req);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}

// Handler for setting FPS
static esp_err_t fps_handler(httpd_req_t *req)
{
    char query[32] = {0};
    char value[8] = {0};
    bool changed = false;

