14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        if (httpd_query_key_value(query, "value", value, sizeof(value)) == ESP_OK) {
            int fps = atoi(value);
            if (fps > 0) {
                setTargetFPS(fps);
                changed = true;
            }
        }
    }

    httpd_resp_set_type(req, "text/plain");
    if (changed) {
        httpd_resp_sendstr(req, "FPS updated");
    } else {
        char resp[64];
        snprintf(resp, sizeof(resp), "Current FPS: %d", targetFPS);
        httpd_resp_sendstr(req, resp);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return ESP_OK;
}

// Stream handler for MJPEG streaming
static esp_err_t stream_handler(httpd_req_t *req)
{
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char part_buf[128];

    // Check if recording is in progress
    if (isRecording)
    {
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_set_status(req, "409 Conflict");
        httpd_resp_sendstr(req, "Cannot stream while recording is in progress");
        return ESP_OK;
    }

    // Set streaming flag
    isStreaming = true;
    Serial.println("Stream started");

    // Set response type
    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        isStreaming = false;
        return res;
    }

    // Set no cache headers
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_set_hdr(req, "Expires", "0");

    // Main streaming loop
    while (true)
    {
        // Check if recording has started (should stop streaming)
        if (isRecording)
        {
            Serial.println("Recording started, stopping stream");
            res = ESP_OK;
            break;
        }

        // Get frame from camera
        fb = esp_camera_fb_get();
        if (!fb)
        {
            Serial.println("Camera capture failed");
            res = ESP_FAIL;
            break;
        }

        // If format is not JPEG, convert it
        if (fb->format != PIXFORMAT_JPEG)
        {
            bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
            esp_camera_fb_return(fb);
            fb = NULL;

            if (!jpeg_converted)
            {
                Serial.println("JPEG compression failed");
                res = ESP_FAIL;
                break;
            }
        }
        else
        {
            _jpg_buf_len = fb->len;
            _jpg_buf = fb->buf;
        }

        // Get MPU data if enabled
        MPUData mpu_data = {};
        if (enableMPU)
        {
            readMPUData();
            mpu_data = getMPUData();
        }

        // Get current time for timestamp
        struct timeval tv;
        gettimeofday(&tv, NULL);

        // Format the multipart header with timestamp and IMU data
        snprintf(part_buf, 128, _STREAM_PART, _jpg_buf_len, tv.tv_sec, tv.tv_usec);

        // Send multipart boundary and header
        res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        if (res != ESP_OK)
        {
            break;
        }

        res = httpd_resp_send_chunk(req, (const char *)part_buf, strlen((const char *)part_buf));
        if (res != ESP_OK)
        {
            break;
        }

        // Send the JPEG image data
        res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        if (res != ESP_OK)
        {
            break;
        }

        // Clean up
        if (fb)
        {
            esp_camera_fb_return(fb);
            fb = NULL;
            _jpg_buf = NULL;
        }
        else if (_jpg_buf)
        {
            free(_jpg_buf);
            _jpg_buf = NULL;
        }

        // Add a small delay to control frame rate and prevent overwhelming the network
        // This also helps maintain the target FPS
        int delay_ms = minFrameTimeMs > 0 ? minFrameTimeMs : 100;
        vTaskDelay(pdMS_TO_TICKS(delay_ms));

        // Check for errors in previous operations which might indicate client disconnection
        if (res != ESP_OK) {
            Serial.println("Client may have disconnected");
            break;
        }
    }

    // Clean up any remaining resources
    if (fb)
    {
        esp_camera_fb_return(fb);
        fb = NULL;
    }

    if (_jpg_buf)
    {
        free(_jpg_buf);
        _jpg_buf = NULL;
    }

    // Reset streaming flag
    isStreaming = false;
    Serial.println("Stream ended");

    return res;
}

// Handler for getting recording statistics
static esp_err_t recording_stats_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    char json_response[256];

    if (isRecording) {
        // Calculate recording duration in seconds
        unsigned long duration = (millis() - recordingStartTime) / 1000;

        // Format file size to human-readable format
        char size_str[32];
        if (currentRecordingSize < 1024) {
            snprintf(size_str, sizeof(size_str), "%u B", (unsigned int)currentRecordingSize);
        } else if (currentRecordingSize < 1024 * 1024) {
            snprintf(size_str, sizeof(size_str), "%.1f KB", currentRecordingSize / 1024.0);
        } else {
            snprintf(size_str, sizeof(size_str), "%.2f MB", currentRecordingSize / (1024.0 * 1024.0));
        }

        // Extract filename from path
        const char* filename = strrchr(currentRecordingPath.c_str(), '/');
        if (filename) {
            filename++; // Skip the slash
        } else {
            filename = currentRecordingPath.c_str();
        }

        // Create JSON response
        snprintf(json_response, sizeof(json_response),
                 "{\"recording\":true,\"duration\":%lu,\"frames\":%d,\"fps\":%.1f,\"size\":\"%s\",\"filename\":\"%s\"}",
                 duration, currentFrameCount, currentFps, size_str, filename);
    } else {
        // Not recording
        snprintf(json_response, sizeof(json_response), "{\"recording\":false}");
    }

    return httpd_resp_sendstr(req, json_response);
}


void startCameraServer()
{
    // Redirect ESP-IDF log output to Arduino Serial
    redirect_esp_log_to_serial();

